cases/aspiration/0.org/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outletFlow
    {
        type            zeroGradient;
    }

    outletProbe
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    wedgeFront
    {
        type            wedge;
    }

    wedgeBack
    {
        type            wedge;
    }

    axis
    {
        type            symmetryPlane;
    }

    wallProbe
    {
        type            fixedValue;
        value           $internalField;
    }
}
