cases/aspiration/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.2;

vertices
(
    (0     0 0)
    (0.025 0 0)
    (0.105 0 0)

    (0     -2.450428508239015e-04 0.004975923633361)
    (0.025 -2.450428508239015e-04 0.004975923633361)
    (0.105 -2.450428508239015e-04 0.004975923633361)

    (0     -2.756732071768892e-04 0.005597914087531)
    (0.025 -2.756732071768892e-04 0.005597914087531)
    (0.105 -2.756732071768892e-04 0.005597914087531)

    (0     -0.002236016013768    0.045405303154419)
    (0.025 -0.002236016013768    0.045405303154419)
    (0.105 -0.002236016013768    0.045405303154419)

    (0      2.450428508239015e-04 0.004975923633361)
    (0.025  2.450428508239015e-04 0.004975923633361)
    (0.105  2.450428508239015e-04 0.004975923633361)

    (0      2.756732071768892e-04 0.005597914087531)
    (0.025  2.756732071768892e-04 0.005597914087531)
    (0.105  2.756732071768892e-04 0.005597914087531)

    (0      0.002236016013768    0.045405303154419)
    (0.025  0.002236016013768    0.045405303154419)
    (0.105  0.002236016013768    0.045405303154419)
);

blocks
(
    hex (0 1 1 0 3 4 13 12) (20 1 4) simpleGrading (0.5 1 0.5)
    hex (1 2 2 1 4 5 14 13) (64 1 4) simpleGrading (2 1 0.5)
    hex (3 4 13 12 6 7 16 15) (20 1 1) simpleGrading (0.5 1 1)
    hex (6 7 16 15 9 10 19 18) (20 1 32) simpleGrading (0.5 1 2)
    hex (7 8 17 16 10 11 20 19) (64 1 32) simpleGrading (2 1 2)
);

edges
();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 12 0)
            (3 6 15 12)
            (6 9 18 15)
        );
    }
    outletProbe
    {
        type patch;
        faces
        (
            (2 5 14 2)
        );
    }
    outletFlow
    {
        type patch;
        faces
        (
            (8 11 20 17)
        );
    }
    wedgeFront
    {
        type wedge;
        faces
        (
            (0 1 4 3)
            (1 2 5 4)
            (3 4 7 6)
            (6 7 10 9)
            (7 8 11 10)
        );
    }
    wedgeBack
    {
        type wedge;
        faces
        (
            (0 12 13 1)
            (1 13 14 2)
            (12 15 16 13)
            (15 18 19 16)
            (16 19 20 17)
        );
    }
    top
    {
        type patch;
        faces
        (
            (9 10 19 18)
            (10 11 20 19)
        );
    }
    axis
    {
        type symmetryPlane;
        faces
        (
            (0 1 1 0)
            (1 2 2 1)
        );
    }
    wallProbe
    {
        type wall;
        faces
        (
            (4 5 14 13)
            (13 16 7 4)
            (16 17 8 7)
        );
    }
);

mergePatchPairs
(
);
